export const pledgeContent = `
구구절절 재미없는 인생/학교 생활 이야기와 장황한 자기 소개, 과장이 포함된 어필은 하지 않겠습니다. 그런 말은 누구나 다 하는 뻔한 이야기니까요.

믿기지 않을 수도 있겠지만 저는 누군가에게 도움을 주는 것에 진심인, 그리고 그 도움을 통해 함께 성장하는 것에 기쁨을 느끼는 희한한 사람입니다. 이 자기주장을 믿는 것은 자유이지만, 스마트보안솔루션과 대표로 출마하게 된 이유도 바로 그 때문이죠.

단지 더욱 더 나은 스마트보안솔루션과(이하 보안과)를 만들어가기 위해, 그리고 모두가 잘 먹고 잘 살도록, 사람답게 살아갈 수 있도록 최소한의 도움과 약속을 드리고자 합니다.

# 1. 타 학과 교류 본격 활성화

## 1-1. 배경 및 필요성

이건 보안과를 넘어 학교 전체에 해당되는 내용인데, 개인적인 친분이 있는 학생들 끼리는 타 학과라도 교류가 있겠지만 학교 또는 학과 차원에서 직접적으로 나서서 교류하는 활동이 거의 없습니다.

특히 전공 관련 교류는 아예 없는 수준입니다만, 잘 생각해보면 각 학과의 분야별로 교류가 필요한 경우가 분명히 존재합니다. 

> 예를 들어 인공지능 시대에 필수적인 보안 분야와 클라우드 컴퓨팅 분야는 보안과에서 담당하는 부분이 크고, 반대로 보안과에서도 인공과에서 담당하는 분야인 인공지능이나 빅데이터 분석 등의 기술을 필요로 합니다.
> 
> 하지만 각 학과의 학생들은 대게 자신의 전공 분야만 공부하기 때문에 이러한 상호 보완적인 지식과 경험을 쌓기가 어렵죠.

일례로 최근에 예비 취업 맞춤반을 수강하면서 타 학과 학생들의 전공 모습을 접할 기회가 있었습니다. 그때 생각했던 것 보다 타 학과 학생들간의 호기심이 상당히 많았다는 것도 느꼈습니다. 그래서 곧장 이러한 주제를 생각하게 되었죠.

그래서 저는 이와 관련하여 선두주자가 되어 타 학과와의 교류를 본격적으로 활성화하고자 합니다. 

## 1-2. 추진 방안

구체적인 내용은 각 학과의 사정에 따라 달라질 수 있겠지만, "대략 이러한 방향으로 진행된다" 정도로 이해해주시면 좋겠습니다.

가장 확실한 방법은 각 학과의 전공 심화 동아리를 활용하는 것이지 않을까 생각합니다. 자율 동아리를 만들어 각 학과의 학생들이 함께 모여 프로젝트를 진행한다거나.. 혹은 스터디와 커뮤니케이션을 하는 방식이 될 수 있겠죠.

그게 아니라면 학과 차원에서 정기적인 교류 세미나나 워크숍을 개최하는 것도 좋은 방법이라고 생각합니다. 이에 대한 구체적인 계획은 당선 이후에 타 학과 대표나 선생님들과의 협의하에 결정하도록 하겠습니다.

물론 각 과의 학생들끼리 친하지 않은 것은 분명한 사실입니다. 
하지만 늘 그래왔듯, 지속적으로 모이면 언젠가는 친해지게 되는 것이 사람 사는 이치니까요. 적어도 저는 그럴 것이라고 믿습니다.

> TMI지만, 굳이 보안과대로 나선 제가 이 제안을 드렸던 이유는 제가 각 학과의 분야마다 관심이 있었기 때문입니다.
> 
> 한때 LLM에 관심을 가지고 인공지능와 ML, 그리고 MLOps에 대해 공부하려고 시도했었던 적이 있었고, 게임 엔진도 구현해보려고 선형대수학과 그래픽스 프로그래밍도 공부했었습니다. (물론 너무 어려워서 중도 포기했습니다만..)
> 
> ---
> 
> 모빌리티 분야에도 관심이 많았습니다. 아니, 보안과에 들어오기 전 1지망을 모빌리티메이커과로 결정할까 생각도 했었습니다. 아두이노나 기타 (ARM 기반의) 마이크로컨트롤러, SoC 분야에 관심이 많았었거든요. [MOS 6502 에뮬레이터를 만들어보다가](https://github.com/yulmwu/6502) 흥미가 있어 실제 MOS 6502 칩을 구매하여 이리저리 만져보려고도 했었습니다.
> 
> ![PCB](other/PCB.jpeg)
> 
> 일렉기타 연주와 음향에도 관심이 많아, 오래된 게르마늄 PNP/NPN 트랜지스터 등으로 음향 기기를 만들어보기도 했었습니다. 진공관을 다뤄보지 못한건 아쉽지만요.
> 
> 물론 회로도는 대충 인터넷에서 가져와 저항 값이나 커패시터 등의 값만 살짝 튜닝하고, PCB는 대충 동판에 에칭해서 만들거나 브레드보드에서 조립하는 수준이었지만요. (JLCPCB 같은 PCB 주문제작 회사는 나중에 가서야 알았습니다.)
> 
> 납땜 수준은 어디가서 비빌 수 있을 정도라고 자만합니다. 5년 전 18650 리튬이온 배터리를 다루다가 불낼 뻔한 사고도 이제는 추억이 되었네요.
> 
> ![ardu](other/ardu.jpg)
> 
> ---
> 
> 하지만 진짜 저의 분야를 찾고 싶었고, 클라우드가 저에게 가장 맞았던 길이였기에 보안과에 진학하게 되었습니다. 결국 클라우드 전공 동아리 Null4U 부장 자리와 지금의 스마트보안솔루션과 대표 후보자로 올라오게 되었네요.
> 
> 말이 너무 길어서 죄송합니다. 이렇듯 다양한 분야에 관심이 많았기에 타 학과 학생들과 교류하고 싶다는 생각이 더욱 강하게 들었던 것 같습니다. 저의 만족을 떠나, 보안과 학생들에게도 분명히 도움이 될 것이라고 생각합니다.


## 2. 실습실 정비 및 장비/SW 개선

## 3. 전공 심화 동아리 확대 및 지원 강화

## 4. 전공 교육 강화 및 커뮤티니티 활성화

---
`
